## data 불러오기

In [97]:
import pandas as pd
import numpy as np

In [98]:
df = pd.read_csv('C:/Users/happyhill24/Desktop/work/intothecodingworld/task02/data.csv', header=None)

In [99]:
df

       0       1                   2
0  엔씨소프트  언어데이터팀       정민경\n김민지\n조영민
1  엔씨소프트   의미이해팀            허철훈\n정현수
2    카카오   인사담당팀                 NaN
3   삼성전자   마케팅1팀  신짱구\n신짱아\n신형만\n봉미선

## 0열과 1열 합치기

In [100]:
df['combined']=df.apply(lambda x: '%s#%s' % (x[0],x[1]),axis=1)

In [101]:
df['combined']

0    엔씨소프트#언어데이터팀
1     엔씨소프트#의미이해팀
2       카카오#인사담당팀
3      삼성전자#마케팅1팀
Name: combined, dtype: object

In [102]:
df.columns

Index([0, 1, 2, 'combined'], dtype='object')

In [103]:
df=df[['combined',2]]

In [104]:
df

       combined                   2
0  엔씨소프트#언어데이터팀       정민경\n김민지\n조영민
1   엔씨소프트#의미이해팀            허철훈\n정현수
2     카카오#인사담당팀                 NaN
3    삼성전자#마케팅1팀  신짱구\n신짱아\n신형만\n봉미선

In [105]:
#모든 row 결합 시키는 방법
#df['combined']=df[cols].apply(lambda row:'#'.join(row.values.astype(str)),axis=1)

In [106]:
#index를 칼럼으로 살려두기
company_team=df.combined
company_team=company_team.reset_index()

In [107]:
company_team

   index      combined
0      0  엔씨소프트#언어데이터팀
1      1   엔씨소프트#의미이해팀
2      2     카카오#인사담당팀
3      3    삼성전자#마케팅1팀

### 남은 PROCESS
1. 개행 별로 쪼개기
2. 개행 별로 쪼갠 뒤 텍스트 개수만큼 아래에 행 생성
3. 위에서 combined 열과 merge

In [108]:
#개행 별로 쪼개기
split_df=df[2].str.split('\n')
split_df

0         [정민경, 김민지, 조영민]
1              [허철훈, 정현수]
2                     NaN
3    [신짱구, 신짱아, 신형만, 봉미선]
Name: 2, dtype: object

In [109]:
split_df=split_df.apply(lambda x:pd.Series(x))
split_df

     0    1    2    3
0  정민경  김민지  조영민  NaN
1  허철훈  정현수  NaN  NaN
2  NaN  NaN  NaN  NaN
3  신짱구  신짱아  신형만  봉미선

# 칼럼을 행으로 바꾸기
stack()을 실행하면, 멀티 인덱스를 가진 Series가 된다.

In [110]:
split_df.stack()

0  0    정민경
   1    김민지
   2    조영민
1  0    허철훈
   1    정현수
3  0    신짱구
   1    신짱아
   2    신형만
   3    봉미선
dtype: object

인덱스를 초기화하고, 기준이 된 인덱스도 제거

In [111]:
split_df=split_df.stack().reset_index(level=1,drop=True)
split_df

0    정민경
0    김민지
0    조영민
1    허철훈
1    정현수
3    신짱구
3    신짱아
3    신형만
3    봉미선
dtype: object

In [113]:
split_df.index

Int64Index([0, 0, 0, 1, 1, 3, 3, 3, 3], dtype='int64')

In [114]:
#index를 칼럼으로 살려두기
split_df=split_df.reset_index()
split_df

   index    0
0      0  정민경
1      0  김민지
2      0  조영민
3      1  허철훈
4      1  정현수
5      3  신짱구
6      3  신짱아
7      3  신형만
8      3  봉미선

## merge

In [115]:
merge=pd.merge(company_team,split_df)
merge

   index      combined    0
0      0  엔씨소프트#언어데이터팀  정민경
1      0  엔씨소프트#언어데이터팀  김민지
2      0  엔씨소프트#언어데이터팀  조영민
3      1   엔씨소프트#의미이해팀  허철훈
4      1   엔씨소프트#의미이해팀  정현수
5      3    삼성전자#마케팅1팀  신짱구
6      3    삼성전자#마케팅1팀  신짱아
7      3    삼성전자#마케팅1팀  신형만
8      3    삼성전자#마케팅1팀  봉미선

In [116]:
merge.drop(['index'],axis=1,inplace=True)
merge

       combined    0
0  엔씨소프트#언어데이터팀  정민경
1  엔씨소프트#언어데이터팀  김민지
2  엔씨소프트#언어데이터팀  조영민
3   엔씨소프트#의미이해팀  허철훈
4   엔씨소프트#의미이해팀  정현수
5    삼성전자#마케팅1팀  신짱구
6    삼성전자#마케팅1팀  신짱아
7    삼성전자#마케팅1팀  신형만
8    삼성전자#마케팅1팀  봉미선

**axis** : 삭제를 가로(행) 기준으로 할 것인지, 세로(열) 기준으로 할 것인지 명시하는 'drop()' 메소드의 파라미터이다.  
**inplace** : 'merge' data를 그대로 쓰고 싶은 경우

In [117]:
# 칼럼 이름 변경
merge.columns=['combined','name']
merge

       combined name
0  엔씨소프트#언어데이터팀  정민경
1  엔씨소프트#언어데이터팀  김민지
2  엔씨소프트#언어데이터팀  조영민
3   엔씨소프트#의미이해팀  허철훈
4   엔씨소프트#의미이해팀  정현수
5    삼성전자#마케팅1팀  신짱구
6    삼성전자#마케팅1팀  신짱아
7    삼성전자#마케팅1팀  신형만
8    삼성전자#마케팅1팀  봉미선

추출~!

In [118]:
merge.to_excel('merge.xlsx')